---
kind: property
id: P:Autodesk.Revit.DB.FilledRegionType.ForegroundPatternColor
source: html/539f5a5e-e9a1-cafb-0d2b-350645041f87.htm
---
# Autodesk.Revit.DB.FilledRegionType.ForegroundPatternColor Property

The foreground fill pattern color.

## Syntax (C#)
```csharp
public Color ForegroundPatternColor { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null